Autodesk.Revit.DB.WallSweepInfo.IsEqual(Autodesk.Revit.DB.WallSweepInfo)
Determines if the input object is equivalent to this WallSweepInfo.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.WallSweepInfo.IsFixed
Indicates if the described wall sweep is fixed.  A sweep is fixed if it is a part of a vertical compound structure.
Remarks:
Wall sweeps from the definition of a vertical compound structure are fixed based on the wall type's definition.
They are not permitted to be moved by users.
Other wall sweeps defined outside of CompoundStructure by UI or API are permitted to be moved.
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.IsVertical
Indicates whether the sweep or reveal is swept vertically or horizontally.
Remarks:
Wall sweeps defined as a part of a vertical compound structure will always be horizontal.
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.CutsWall
Indicates if you want the sweep to cut geometry out of the host wall.
Remarks:
When a sweep is offset and embedded in the wall, it cuts the geometry from the wall.
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.IsCutByInserts
Indicates if the sweep is cut by wall inserts.
True if the sweep is cut by wall inserts, false otherwise.
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.IsProfileFlipped
Indicates if the profile is applied upside-down.
True if the profile is applied upside-down, false otherwise.
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.DistanceMeasuredFrom
Indicates if Distance is measured from the top or bottom of the wall.
If the sweep or reveal is vertical, DistanceMeasuredFrom.Base represents the
start of the wall's location curve (t=0), and DistanceMeasuredFrom.Top represents the
end of the wall's location curve (t=1).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.WallSweepType
The type (either a wall sweep or a reveal).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.WallSide
The side of the wall to which the sweep or reveal is attached.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.Id
The id of the sweep or reveal.
If the wall sweep belongs to a vertically compound structure, this must be a non-negative
value.  If the wall sweep belongs to a sweep defined outside of compound structures by UI or API
the id will typically be -1 and is not used.
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.MaterialId
The element id of the material used to create the sweep or reveal.
Remarks:
This value is not used when creating standalone wall sweeps.  The material id of the
wall sweep's type is used instead.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.ProfileId
The element id of the profile family used to create the sweep or reveal.
Remarks:
This value is not used when creating standalone wall sweeps.  The profile id of the
wall sweep's type is used instead.
May be InvalidElementId if the default profile is used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.DefaultSetback
The sweep setback distance from inserts, such as windows and doors.
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.WallOffset
The offset from the sweep or reveal to the wall.
A negative value moves the sweep toward the wall core.
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.Distance
The distance from either the top or base of the wall.
DistanceMeasuredFrom determines whether the measurement is from the top or base of the wall.
If the sweep or reveal is vertical, this is the horizontal distance from the start or end of the wall.
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.#ctor(Autodesk.Revit.DB.WallSweepType,System.Boolean)
Constructs a new WallSweepInfo instance.
type:
The type of the WallSweepInfo instance.
vertical:
True to construct a vertical wall sweep, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.#ctor(System.Boolean,Autodesk.Revit.DB.WallSweepType)
Constructs a new WallSweepInfo instance.
fixed:
True if the WallSweepInfo should be fixed (suitable for use in CompoundStructure.AddWallSweep()).
False if the WallSweepInfo should be suitable for use in standalone wall sweep or reveal elements.
type:
The type of the WallSweepInfo instance.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.WallSweepInfo
Represents a wall sweep or reveal of a vertically compound structure.
Since:
2012